/*
データベース演習I 6週目
クラス：SE1A15
制作者：コウユウショウ
作成日：2020/11/04
*/

--問１
mysql> select min(hiredate)
    -> as '入社日'
    -> from employee;
+------------+
| 入社日     |
+------------+
| 2007-06-15 |
+------------+
1 row in set (0.01 sec)

--問２
mysql>  select max(rank_point)as '最大ポイント',
    -> min(rank_point)as '最小ポイント'
    -> from employee;
+--------------------+--------------------+
| 最大ポイント       | 最小ポイント       |
+--------------------+--------------------+
|               2500 |                100 |
+--------------------+--------------------+
1 row in set (0.00 sec)

--問３
mysql> select avg(salary) as '平均時給'
    -> from employee
    -> where job != '店長';
+--------------+
| 平均時給     |
+--------------+
|     907.5000 |
+--------------+
1 row in set (0.00 sec)

--問４
mysql> select work_store as '店舗コード',avg(salary) as '平均時給'
    -> from employee
    ->  where job != '店長'
    -> group by work_store;
+-----------------+--------------+
| 店舗コード      | 平均時給     |
+-----------------+--------------+
| 001             |     916.6667 |
| 002             |     917.5000 |
| 005             |     894.0000 |
+-----------------+--------------+
3 rows in set (0.00 sec)

--問５
mysql> select job as '職種',count(job) as '人数'
    -> from employee
    -> group by job;
+--------+--------+
| 職種   | 人数   |
+--------+--------+
| 店長   |      4 |
| 受付   |      3 |
| 配達   |      5 |
| 調理   |      4 |
+--------+--------+
4 rows in set (0.00 sec)

--問6
mysql> select work_store as '店舗コード', job as '職種', format( avg(salary),0)as '平均時給'
    -> from employee
    -> group by job, work_store
    -> order by avg(salary) DESC;
+-----------------+--------+--------------+
| 店舗コード      | 職種   | 平均時給     |
+-----------------+--------+--------------+
| 003             | 店長   | 5,000        |
| 001             | 店長   | 2,875        |
| 002             | 店長   | 2,875        |
| 005             | 店長   | 2,000        |
| 001             | 受付   | 950          |
| 002             | 配達   | 945          |
| 005             | 調理   | 920          |
| 001             | 配達   | 900          |
| 001             | 調理   | 900          |
| 002             | 調理   | 890          |
| 002             | 受付   | 890          |
| 005             | 受付   | 890          |
| 005             | 配達   | 870          |
+-----------------+--------+--------------+
13 rows in set (0.00 sec)

--問7
mysql> select count(distinct mgr_no)as 'マネージャーの人数'
    -> from employee;
+-----------------------------+
| マネージャーの人数          |
+-----------------------------+
|                           4 |
+-----------------------------+
1 row in set (0.00 sec)

--問8
mysql> select mgr_no  as 'マネージャー番号',  count(mgr_no) as '部下の人数'
    ->  from employee
    -> where mgr_no != 'NULL'
    ->  group by mgr_no;
+--------------------------+-----------------+
| マネージャー番号         | 部下の人数      |
+--------------------------+-----------------+
| 00001                    |               3 |
| 00002                    |               3 |
| 00006                    |               4 |
| 00016                    |               5 |
+--------------------------+-----------------+
4 rows in set (0.00 sec)


--問9
mysql> select mgr_no  as 'マネージャー番号',  count(mgr_no) as '部下の人数'
    -> from employee
    -> where mgr_no != 'NULL'
    -> group by mgr_no
    -> having count(mgr_no) <= 4;
+--------------------------+-----------------+
| マネージャー番号         | 部下の人数      |
+--------------------------+-----------------+
| 00001                    |               3 |
| 00002                    |               3 |
| 00006                    |               4 |
+--------------------------+-----------------+
3 rows in set (0.00 sec)

--問10
mysql> select year(hiredate) as '入社年度', count(hiredate) as '人数'
    -> from employee
    -> group by year(hiredate)
    -> order by year(hiredate) ;
+--------------+--------+
| 入社年度     | 人数   |
+--------------+--------+
|         2007 |      1 |
|         2010 |      3 |
|         2013 |      5 |
|         2015 |      3 |
|         2016 |      2 |
|         2020 |      2 |
+--------------+--------+
6 rows in set (0.00 sec)
