/*
データベース演習I 7週目
クラス：SE1A15
制作者：コウユウショウ
作成日：2020/11/11
*/

--問１
mysql> select * from rankpoint;
+--------------------+--------------------------------------------------------------------------------------+----------+----------+
| RANK_NAME          | RANK_DESC                                                                            | LO_POINT | HI_POINT |
+--------------------+--------------------------------------------------------------------------------------+----------+----------+
| ビギナー           | 仕事内容が未習得の従業員。ベテラン以上と一緒に仕事を行う                             |        0 |      500 |
| ミドル             | ピークタイム以外であれば仕事を1人でこなせる                                          |      501 |     2000 |
| ベテラン           | 見本となる勤務が出来てビギナーに仕事を教えることが出来る                             |     2001 |     4000 |
| エキスパート       | ピークタイム時に主軸となれる人材                                                     |     4001 |     8000 |
| マスター           | 仕事に精通しており最高峰のサービスを提供できる人材                                   |     8001 |     9999 |
+--------------------+--------------------------------------------------------------------------------------+----------+----------+
5 rows in set (0.00 sec)

--問２
mysql> SELECT E.EMP_NO ,E.ENAME,  E.RANK_POINT,  R.RANK_NAME
    -> FROM  EMPLOYEE AS E
    -> JOIN  RANKPOINT AS R  ON  ( E.RANK_POINT >= R.LO_POINT  AND
    -> E.RANK_POINT <= R.HI_POINT )
    ->  where e.rank_point >=2001;
+--------+--------------+------------+--------------+
| EMP_NO | ENAME        | RANK_POINT | RANK_NAME    |
+--------+--------------+------------+--------------+
| 00001  | 小林友治     |       2500 | ベテラン     |
| 00002  | 小林圭輔     |       2500 | ベテラン     |
| 00006  | 村上信五     |       2500 | ベテラン     |
| 00016  | 升野英知     |       2500 | ベテラン     |
+--------+--------------+------------+--------------+
4 rows in set (0.00 sec)

--問３
mysql> select s.sname , s.status, e.emp_no, e.ename, e.job
    -> from employee as e
    -> join store as s on(e.work_store = s.store_no)
    -> where s.holiday = '土日';
+--------------+-----------+--------+-----------------+--------+
| sname        | status    | emp_no | ename           | job    |
+--------------+-----------+--------+-----------------+--------+
| 生駒店       | 閉店済    | 00001  | 小林友治        | 店長   |
| 阿倍野店     | 営業中    | 00011  | 秋元真夏        | 調理   |
| 阿倍野店     | 営業中    | 00012  | 生田絵梨花      | 配達   |
| 阿倍野店     | 営業中    | 00014  | 白石麻衣        | 調理   |
| 阿倍野店     | 営業中    | 00015  | 高山一実        | 受付   |
| 阿倍野店     | 営業中    | 00016  | 升野英知        | 店長   |
| 阿倍野店     | 営業中    | 00017  | 松村沙友里      | 配達   |
+--------------+-----------+--------+-----------------+--------+
7 rows in set (0.00 sec)

--問４
mysql> select s.prefectures as '店舗エリア',
    -> count(e.emp_no) as '人数'from employee as e
    -> join store as s on(e.work_store = s.store_no)
    -> group by s.prefectures;
+-----------------+--------+
| 店舗エリア      | 人数   |
+-----------------+--------+
| 奈良県          |      1 |
| 大阪府          |     15 |
+-----------------+--------+
2 rows in set (0.01 sec)

--問５
mysql> select * from recipe;
+------------+-------------+----------+
| PRODUCT_NO | MATERIAL_NO | QUANTITY |
+------------+-------------+----------+
| 0001       | 00001       |        1 |
| 0001       | 00002       |        2 |
| 0001       | 00012       |        1 |
| 0001       | 00014       |        3 |
| 0001       | 00020       |        1 |
| 0002       | 00001       |        1 |
| 0002       | 00006       |        3 |
| 0002       | 00007       |        3 |
| 0002       | 00010       |        1 |
| 0002       | 00015       |        1 |
| 0002       | 00016       |        1 |
| 0002       | 00020       |        1 |
| 0003       | 00001       |        1 |
| 0003       | 00003       |        1 |
| 0003       | 00011       |        1 |
| 0003       | 00014       |        1 |
| 0003       | 00015       |        1 |
| 0003       | 00020       |        1 |
| 0004       | 00001       |        1 |
| 0004       | 00006       |        2 |
| 0004       | 00007       |        2 |
| 0004       | 00008       |        2 |
| 0004       | 00020       |        1 |
| 0005       | 00001       |        1 |
| 0005       | 00008       |        2 |
| 0005       | 00009       |        2 |
| 0005       | 00013       |        1 |
| 0005       | 00021       |        1 |
| 0006       | 00001       |        1 |
| 0006       | 00009       |        3 |
| 0006       | 00018       |        1 |
| 0006       | 00020       |        1 |
| 0006       | 00021       |        1 |
| 9001       | 00001       |        1 |
| 9001       | 00002       |        2 |
| 9001       | 00003       |        2 |
| 9001       | 00004       |        2 |
| 9001       | 00005       |        2 |
| 9001       | 00023       |        1 |
| 9002       | 00001       |        1 |
| 9002       | 00012       |        1 |
| 9002       | 00014       |        1 |
| 9002       | 00015       |        1 |
| 9002       | 00016       |        1 |
| 9002       | 00017       |        1 |
| 9002       | 00018       |        1 |
| 9002       | 00019       |        1 |
| 9002       | 00021       |        1 |
| 9003       | 00001       |        1 |
| 9003       | 00003       |        1 |
| 9003       | 00011       |        1 |
| 9003       | 00014       |        1 |
| 9003       | 00015       |        1 |
| 9003       | 00022       |        1 |
+------------+-------------+----------+
54 rows in set (0.02 sec)

問６
mysql> select p.pname as PNAME,m.mname as MNAME,m.origin as ORIGIN, r.quantity as QUANTITY
    -> from product as p
    -> join recipe as r on p.product_no = r.product_no
    -> join material as m on r.material_no = m.material_no
    -> where p.product_no = '0001';
+--------------------+-----------------------------+--------------+----------+
| PNAME              | MNAME                       | ORIGIN       | QUANTITY |
+--------------------+-----------------------------+--------------+----------+
| マルゲリータ       | チーズ                      | 北海道       |        1 |
| マルゲリータ       | モッツァレラチーズ          | 北海道       |        2 |
| マルゲリータ       | バジル                      | イタリア     |        1 |
| マルゲリータ       | トマト                      | 熊本         |        3 |
| マルゲリータ       | トマトソース                | NULL         |        1 |
+--------------------+-----------------------------+--------------+----------+
5 rows in set (0.00 sec)

問７
mysql> select p.pname as PNAME,
    -> sum(r.quantity * m.cost) as '商品原価'
    -> from product as p
    -> join recipe as r on p.product_no = r.product_no
    -> join material as m on r.material_no = m.material_no
    -> group by p.pname;
+--------------------------+--------------+
| PNAME                    | 商品原価     |
+--------------------------+--------------+
| マルゲリータ             |         1575 |
| デラックスピザ           |         2245 |
| シーフードピザ           |         1110 |
| ギガミート               |         1860 |
| チキン＆ベーコン         |         1595 |
| BBQチキン                |         1350 |
+--------------------------+--------------+
6 rows in set (0.01 sec)